clc
clear
%价格差
x1=[-0.05,0.25,0.60,0,0.25,0.20,0.15,0.05,-0.15,0.15...
    0.20,0.10,0.40,0.45,0.35,0.30,0.50,0.50,0.40,-0.05...
    -0.05,-0.10,0.20,0.10,0.50,0.60,-0.05,0,0.05,0.55]';
%广告费用
x2=[5.50 6.75 7.25 5.50 7.00 6.50 6.75 5.25 5.25 6.00...
    6.50 6.25 7.00 6.90 6.80 6.80 7.10 7.00 6.80 6.50...
    6.25 6.00 6.50 7.00 6.80 6.80 6.50 5.75 5.80 6.80]';
%销售量
y=[7.38 8.51 9.52 7.50 9.33 8.28 8.75 7.87 7.10 8.00...
   7.89 8.15 9.10 8.86 8.90 8.87 9.26 9.00 8.75 7.95...
   7.65 7.27 8.00 8.50 8.75 9.21 8.27 7.67 7.93 9.26]';
% %y对x1的散点图及估计值
% figure(1)
% plot(x1,y,'o');
% title('y对x1的散点图');
% hold on
% [p1, S1]=polyfit(x1,y,1);
% xx1=-0.20:0.01:0.60;
% Y1=polyval(p1,xx1);
% plot(xx1, Y1, 'r')

% % %y对x2的散点图及估计值
% figure(2)
% plot(x2,y,'*');
% title('y对x2的散点图');
% hold on
% [p2, S2]=polyfit(x2,y,2);
% xx2=5:0.1:7.5;
% Y2=polyval(p2,xx2);
% plot(xx2, Y2, 'r')

% %回归模型
% X=[ones(size(x1)),x1,x2,x2.^2];
% [b,bint,r,rint,stats]=regress(y,X)
% figure(3)
% rcoplot(r,rint);
% title('模型残差');
%某参量输出结果
% x1=0.2;
% x2=6.5;
% bary=b(1)+b(2)*x1+b(3)*x2+b(4)*x2^2

% %改进模型
X=[ones(size(x1)),x1,x2,x2.^2,x1.*x2];
[b,bint,r,rint,stats]=regress(y,X)
figure(4)
rcoplot(r,rint);
% title('改进模型残差');
% %完全二项多项式模型
% X=[x1,x2];
% rstool(X,y,'quadratic',0.05);